app/controllers/instructions_controller.rb

  def new
    @instruction = Instruction.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @instruction = current_user.instructions.create(instruction_params)
---
INSERT INTO "instructions" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "How to build a desk"], ["description", "making my own desk"], ["user_id", 1], ["created_at", "2016-08-31 14:00:36.614893"], ["updated_at", "2016-08-31 14:00:36.614893"]]

  def show
    @instruction = Instruction.find(params[:id])
---
SELECT  "instructions".* FROM "instructions" WHERE "instructions"."id" = $1 LIMIT 1  [["id", 1]]